CREATE TABLE Students
(
    Id INT IDENTITY PRIMARY KEY,
    SurName NVARCHAR(30) NOT NULL,
    StudentName NVARCHAR(30) NOT NULL,
    Patronymic NVARCHAR(30) NOT NULL,
    Sex NVARCHAR(10) NOT NULL,
    DateBirth Date NOT NULL,
    StudentGroup NVARCHAR(30) NOT NULL,
    ExamenName_1 NVARCHAR(50) NOT NULL,
    DateExamen_1 Date NOT NULL,
    Mark_1 INT NOT NULL,
    ExamenName_2 NVARCHAR(50) NOT NULL,
    DateExamen_2 Date NOT NULL,
    Mark_2 INT NOT NULL,
    ExamenName_3 NVARCHAR(50) NOT NULL,
    DateExamen_3 Date NOT NULL,
    Mark_3 INT NOT NULL
);

INSERT INTO Students 
VALUES
(N'Крышнев', N'Марат', N'Витальевич', N'Муж', '02/07/2001', N'ИТП-21', N'КС', '01/12/2021', 2, N'Матем', '01/10/2021', 2,  N'ООП', '01/16/2021', 2),
(N'Крук', N'Максим', N'Сергеевич', N'Муж', '06/02/2002', N'ИТИ-22', N'КС', '01/6/2021', 8, N'Ин Яз', '01/14/2021', 8,  N'ООП', '01/15/2021', 8),
(N'Пантюшечкина', N'Анастасия', N'Александровна', N'Жен', '01/05/2002', N'ИТП-21', N'КС', '01/12/2021', 8, N'Матем', '01/10/2021', 7,  N'ООП', '01/16/2021', 8),
(N'Касьян', N'Александр', N'Сергеевич', N'Муж', '02/02/2002', N'ИТП-21', N'КС', '01/12/2021', 3, N'Матем', '01/10/2021', 4,  N'ООП', '01/16/2021', 5),
(N'Ребиков', N'Илья', N'Геннадьевич', N'Муж', '06/02/2002', N'ИТИ-22', N'КС', '01/6/2021', 9, N'Ин Яз', '01/14/2021', 7,  N'ООП', '01/15/2021', 8),
(N'Болотникова', N'Евгения', N'Викторовна', N'Жен', '10/10/2001', N'ИП-21', N'КС', '01/14/2021', 7, N'Экономика', '01/11/2021', 6, N'ОС', '01/17/2021', 6),
(N'Отчик', N'Владислав', N'Михайлович', N'Муж', '06/06/2002', N'ИТП-21', N'КС', '01/12/2021', 6, N'Матем', '01/10/2021', 6,  N'ООП', '01/16/2021', 6),
(N'Есафова', N'Алиса', N'Николаевна', N'Жен', '10/10/2001', N'ИТИ-22', N'КС', '01/6/2021', 4, N'Ин Яз', '01/14/2021', 4,  N'ООП', '01/15/2021', 4),
(N'Мозоль', N'Ольга', N'Александровна', N'Жен', '08/21/2001', N'ИП-21', N'КС', '01/14/2021', 6, N'Экономика', '01/11/2021', 7, N'ОС', '01/17/2021', 5),
(N'Лагунов', N'Дмитрий', N'Васильевич', N'Муж', '07/07/2002', N'ИП-21', N'КС', '01/14/2021', 2, N'Экономика', '01/11/2021', 2, N'ОС', '01/17/2021', 2),
(N'Корнеев', N'Александр', N'Олегович', N'Муж', '04/02/2002', N'ИТП-21', N'КС', '01/12/2021', 7, N'Матем', '01/10/2021', 6,  N'ООП', '01/16/2021', 8),
(N'Бекиев', N'Ыхлас', N'Асламбекович', N'Муж', '06/12/2002', N'ИТП-21', N'КС', '01/12/2021', 2, N'Матем', '01/10/2021', 2,  N'ООП', '01/16/2021', 2),
(N'Крупка', N'Владислав', N'Владимирович', N'Муж', '06/09/2002', N'ИТИ-22', N'КС', '01/6/2021', 2, N'Ин Яз', '01/14/2021', 2,  N'ООП', '01/15/2021', 2),
(N'Руденков', N'Вадим', N'Сергеевич', N'Муж', '07/17/2002', N'ИП-21', N'КС', '01/14/2021', 3, N'Экономика', '01/11/2021', 2, N'ОС', '01/17/2021', 2),
(N'Скуратович', N'Артем', N'Денисович', N'Муж', '02/22/2002', N'ИП-21', N'КС', '01/14/2021', 7, N'Экономика', '01/11/2021', 7, N'ОС', '01/17/2021', 8),
(N'Лобанов', N'Геннадий', N'Евгеньевич', N'Муж', '11/10/2002', N'ИТИ-22', N'КС', '01/6/2021', 2, N'Ин Яз', '01/14/2021', 2,  N'ООП', '01/15/2021', 2),
(N'Савков', N'Илья', N'Юрьевич', N'Муж', '11/12/2002', N'ИТП-21', N'КС', '01/12/2021', 2, N'Матем', '01/10/2021', 2,  N'ООП', '01/16/2021', 2),
(N'Ходанович', N'Ирина', N'Викторовна', N'Жен', '01/11/2002', N'ИТП-21', N'КС', '01/12/2021', 9, N'Матем', '01/10/2021', 8,  N'ООП', '01/16/2021', 8),
(N'Ракицкий', N'Денис', N'Викторович', N'Муж', '11/11/2001', N'ИП-21', N'КС', '01/14/2021', 4, N'Экономика', '01/11/2021', 4, N'ОС', '01/17/2021', 4),
(N'Филонов', N'Никита', N'Игоревич', N'Муж', '11/11/2002', N'ИТИ-22', N'КС', '01/6/2021', 7, N'Ин Яз', '01/14/2021', 8,  N'ООП', '01/15/2021', 5)